chriskinal/QuailTracker/esp32_bridge/src/main.c
    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

/* Catch-all: return 204 for everything not matched by registered handlers.
 * This satisfies ALL captive portal probes (Android, iOS, Windows) so
 * the phone accepts the connection without showing a portal popup.
 * User types any URL → DNS resolves to us → root handler serves the page. */
static esp_err_t catchall_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "204 No Content");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        /* WebSocket handshake — track this client */
        int fd = httpd_req_to_sockfd(req);
        ws_add_client(fd);
        ESP_LOGI(TAG, "WS handshake: fd=%d", fd);
        return ESP_OK;
    }

    /* Receive command from browser */
    httpd_ws_frame_t ws_pkt = {0};
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;
    uint8_t buf[512];
    ws_pkt.payload = buf;
    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, sizeof(buf));
    if (ret == ESP_OK && ws_pkt.len > 0 && ws_pkt.len < sizeof(buf)) {
        buf[ws_pkt.len] = '\0';
        portENTER_CRITICAL(&cmd_mux);
        strncpy(pending_cmd, (char *)buf, sizeof(pending_cmd) - 1);
        pending_cmd[sizeof(pending_cmd) - 1] = '\0';
        portEXIT_CRITICAL(&cmd_mux);
        ESP_LOGI(TAG, "WS cmd: %s", pending_cmd);
    } else if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WS recv error: %s", esp_err_to_name(ret));
    }
    return ESP_OK;
}

/* ── OTA Firmware Update Handler ────────────────────────────────── */

static esp_err_t ota_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "OTA update started, content_len=%d", req->content_len);

    /* Read first chunk and validate ESP32 image magic byte (0xE9) */
    char buf[1024];
    int ret = httpd_req_recv(req, buf, sizeof(buf));
    if (ret <= 0) {
        ws_broadcast("{\"otaErr\":\"No data received\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }
    if ((uint8_t)buf[0] != 0xE9) {
        ESP_LOGE(TAG, "Not ESP32 firmware (magic=0x%02X, expected 0xE9)", (uint8_t)buf[0]);
        ws_broadcast("{\"otaErr\":\"Invalid firmware — not an ESP32 binary\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    if (!update_partition) {
        ws_broadcast("{\"otaErr\":\"No OTA partition\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    esp_ota_handle_t ota_handle;
    esp_err_t err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_begin failed: %s", esp_err_to_name(err));
        ws_broadcast("{\"otaErr\":\"OTA begin failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Write first chunk that we already read */
    err = esp_ota_write(ota_handle, buf, ret);
    if (err != ESP_OK) {
        esp_ota_abort(ota_handle);
        ws_broadcast("{\"otaErr\":\"Write error\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }
    int received = ret;
    int total = req->content_len;

    /* Continue receiving and writing */
    while (received < total) {
        ret = httpd_req_recv(req, buf, sizeof(buf));
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
            esp_ota_abort(ota_handle);
            ws_broadcast("{\"otaErr\":\"Receive error\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

        err = esp_ota_write(ota_handle, buf, ret);
        if (err != ESP_OK) {
            esp_ota_abort(ota_handle);
            ws_broadcast("{\"otaErr\":\"Write error\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

        received += ret;
        if ((received % (64 * 1024)) == 0 || received == total) {
            ESP_LOGI(TAG, "OTA progress: %d/%d (%d%%)",
                     received, total, received * 100 / total);
        }
    }

    err = esp_ota_end(ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_end failed: %s", esp_err_to_name(err));
        ws_broadcast("{\"otaErr\":\"Firmware validation failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    err = esp_ota_set_boot_partition(update_partition);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_set_boot_partition failed: %s", esp_err_to_name(err));
        ws_broadcast("{\"otaErr\":\"Set boot partition failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "OTA update complete (%d bytes), rebooting...", received);
    httpd_resp_sendstr(req, "OK");

    /* Reboot after short delay to let response send */
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_restart();

    return ESP_OK;  /* never reached */
}

/* ── STM32 Firmware Flash Handler ──────────────────────────────── */

/* Stage 1: Receive firmware via HTTP into the "stm32fw" flash partition.
 * Stage 2: Read back from flash and write to STM32 via SPI bootloader.
 * This avoids needing 330KB+ of heap — flash is the staging buffer. */

extern bool spi_initialized;
extern void spi_slave_init(void);
static void spi_task(void *arg);

/* STM32 flash progress — updated by stm32_flash, read by status endpoint */
static volatile int stm32_flash_pct = -1;  /* -1 = not flashing */

#include "esp_partition.h"
#define STM32FW_PARTITION_LABEL "stm32fw"

static void stm32_flash_progress(int pct)
{
    stm32_flash_pct = pct;
    /* Push progress over WebSocket so browser updates in real time */
    if (ws_server) {
        char json[48];
        snprintf(json, sizeof(json), "{\"stm32flash\":%d}", pct);
        ws_broadcast(json);
    }
}

static esp_err_t flash_status_handler(httpd_req_t *req)
{
    char buf[32];
    snprintf(buf, sizeof(buf), "{\"pct\":%d}", stm32_flash_pct);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

