chriskinal/QuailTracker/esp32_bridge/src/main.c
static esp_err_t stm32_ota_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "STM32 flash started, content_len=%d", req->content_len);

    if (req->content_len <= 0 || req->content_len > 512 * 1024) {
        ws_broadcast("{\"stm32Err\":\"Invalid firmware size\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Read first chunk and validate STM32 header before doing anything */
    char buf[1024];
    int ret = httpd_req_recv(req, buf, sizeof(buf));
    if (ret < 8) {
        ws_broadcast("{\"stm32Err\":\"No data received\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Validate: SP = 0x2000xxxx, reset vector = 0x0800xxxx */
    uint32_t sp = (uint8_t)buf[0] | ((uint8_t)buf[1] << 8) |
                  ((uint8_t)buf[2] << 16) | ((uint8_t)buf[3] << 24);
    uint32_t rv = (uint8_t)buf[4] | ((uint8_t)buf[5] << 8) |
                  ((uint8_t)buf[6] << 16) | ((uint8_t)buf[7] << 24);
    if ((sp & 0xFFF00000) != 0x20000000 || (rv & 0xFFF00000) != 0x08000000) {
        ESP_LOGE(TAG, "Not STM32 firmware (SP=0x%08lx RV=0x%08lx)",
                 (unsigned long)sp, (unsigned long)rv);
        ws_broadcast("{\"stm32Err\":\"Invalid firmware — not an STM32 binary\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Find the staging partition */
    const esp_partition_t *part = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, 0x80, STM32FW_PARTITION_LABEL);
    if (!part) {
        ws_broadcast("{\"stm32Err\":\"No staging partition\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Erase the staging partition */
    esp_err_t err = esp_partition_erase_range(part, 0, part->size);
    if (err != ESP_OK) {
        ws_broadcast("{\"stm32Err\":\"Partition erase failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Write first chunk that we already read */
    err = esp_partition_write(part, 0, buf, ret);
    if (err != ESP_OK) {
        ws_broadcast("{\"stm32Err\":\"Write failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }
    int received = ret;
    int total = req->content_len;

    /* Stage 1: Continue receiving firmware and writing to flash partition */
    while (received < total) {
        ret = httpd_req_recv(req, buf, sizeof(buf));
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
            ws_broadcast("{\"stm32Err\":\"Receive error\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

        err = esp_partition_write(part, received, buf, ret);
        if (err != ESP_OK) {
            ws_broadcast("{\"stm32Err\":\"Write failed\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

        received += ret;
        if ((received % (64 * 1024)) == 0 || received == total) {
            ESP_LOGI(TAG, "Staged %d / %d bytes (%d%%)",
                     received, total, received * 100 / total);
        }
    }
    ESP_LOGI(TAG, "Firmware staged (%d bytes), validating...", received);

    /* Validate STM32 firmware header: first word = initial SP (0x2000xxxx),
     * second word = reset vector (0x0800xxxx). Rejects ESP32 firmware or
     * random data before attempting to flash. */
    {
        uint8_t hdr[8];
        esp_partition_read(part, 0, hdr, 8);
        uint32_t sp = hdr[0] | (hdr[1] << 8) | (hdr[2] << 16) | (hdr[3] << 24);
        uint32_t rv = hdr[4] | (hdr[5] << 8) | (hdr[6] << 16) | (hdr[7] << 24);
        if ((sp & 0xFFF00000) != 0x20000000 || (rv & 0xFFF00000) != 0x08000000) {
            ESP_LOGE(TAG, "Not a valid STM32 firmware (SP=0x%08lx RV=0x%08lx)",
                     (unsigned long)sp, (unsigned long)rv);
            httpd_resp_set_status(req, "400 Bad Request");
            httpd_resp_set_type(req, "text/plain");
            httpd_resp_sendstr(req, "Invalid firmware — not an STM32 binary");
            return ESP_FAIL;
        }
        ESP_LOGI(TAG, "STM32 header valid (SP=0x%08lx RV=0x%08lx)",
                 (unsigned long)sp, (unsigned long)rv);
    }

    ESP_LOGI(TAG, "Starting STM32 flash");
    stm32_flash_pct = 0;

    /* Stage 2: Stop SPI task, free SPI slave, flash STM32 from partition */
    spi_task_stop = true;
    /* Wait for SPI task to exit (it checks the flag every iteration) */
    for (int i = 0; i < 50 && spi_task_handle != NULL; i++)
        vTaskDelay(pdMS_TO_TICKS(100));
    ESP_LOGI(TAG, "SPI task stopped");

    if (spi_initialized) {
        spi_slave_free(SPI_HOST);
        spi_initialized = false;
    }

    int rc = stm32_flash_from_partition(part, (uint32_t)received, stm32_flash_progress);

    /* Re-initialize SPI slave and restart task */
    spi_slave_init();
    spi_task_stop = false;
    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);

    if (rc != STM32_FLASH_OK) {
        stm32_flash_pct = -1;
        char errmsg[64];
        snprintf(errmsg, sizeof(errmsg), "Flash failed (error %d)", rc);
        ESP_LOGE(TAG, "%s", errmsg);
        httpd_resp_set_status(req, "500 Internal Server Error");
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_sendstr(req, errmsg);
        return ESP_FAIL;
    }

    stm32_flash_pct = 100;
    ESP_LOGI(TAG, "STM32 flash complete, device rebooted");
    httpd_resp_sendstr(req, "OK");
    stm32_flash_pct = -1;
    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    if (ws_server) return ws_server;  /* already running */

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;
    config.stack_size = 8192;
    config.lru_purge_enable = true;    /* close oldest connection when full */
    config.close_fn = on_sock_close;   /* clean up WS client list on disconnect */
    httpd_handle_t server = NULL;

    if (httpd_start(&server, &config) == ESP_OK) {
        httpd_uri_t root = {
            .uri = "/",
            .method = HTTP_GET,
            .handler = root_handler,
        };
        httpd_register_uri_handler(server, &root);

        httpd_uri_t ws = {
            .uri = "/ws",
            .method = HTTP_GET,
            .handler = ws_handler,
            .is_websocket = true,
        };
        httpd_register_uri_handler(server, &ws);

