chriskinal/QuailTracker/esp32_bridge/src/main.c
        httpd_uri_t ota = {
            .uri = "/ota",
            .method = HTTP_POST,
            .handler = ota_handler,
        };
        httpd_register_uri_handler(server, &ota);

        httpd_uri_t stm32_ota = {
            .uri = "/ota_stm32",
            .method = HTTP_POST,
            .handler = stm32_ota_handler,
        };
        httpd_register_uri_handler(server, &stm32_ota);

        httpd_uri_t flash_status = {
            .uri = "/flash_status",
            .method = HTTP_GET,
            .handler = flash_status_handler,
        };
        httpd_register_uri_handler(server, &flash_status);

        httpd_uri_t esp_cfg_get = {
            .uri = "/config_esp",
            .method = HTTP_GET,
            .handler = esp_config_get_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_get);

        httpd_uri_t esp_cfg_post = {
            .uri = "/config_esp",
            .method = HTTP_POST,
            .handler = esp_config_post_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_post);

        /* Register captive portal probe URLs — return 204 so phones
         * don't show portal popup. Any URL typed by user gets resolved
         * to 192.168.9.1 by our DNS, hitting the root "/" handler. */
        const char *probe_uris[] = {
            "/generate_204",
            "/hotspot-detect.html",
            "/ncsi.txt",
            "/connecttest.txt",
            "/redirect",
            "/success.txt",
            NULL
        };
        httpd_uri_t probe = {
            .method = HTTP_GET,
            .handler = catchall_handler,
        };
        for (int i = 0; probe_uris[i]; i++) {
            probe.uri = probe_uris[i];
            httpd_register_uri_handler(server, &probe);
        }

        ESP_LOGI(TAG, "Web server started on port %d", config.server_port);
    }
    ws_server = server;
    return server;
}

static void stop_webserver(void)
{
    if (ws_server) {
        httpd_stop(ws_server);
        ws_server = NULL;
        memset(ws_fds, 0, sizeof(ws_fds));
        ESP_LOGI(TAG, "Web server stopped");
    }
}

/* ── WiFi AP Start/Stop ────────────────────────────────────────── */

static void wifi_init_netif(void)
{
    /* One-time init of netif + event loop (can't be undone) */
    static bool netif_inited = false;
    if (!netif_inited) {
        ESP_ERROR_CHECK(esp_netif_init());
        ESP_ERROR_CHECK(esp_event_loop_create_default());
        wifi_ap_netif = esp_netif_create_default_wifi_ap();

        /* Use 192.168.9.x subnet */
        esp_netif_ip_info_t ip_info;
        esp_netif_str_to_ip4("192.168.9.1", &ip_info.ip);
        esp_netif_str_to_ip4("192.168.9.1", &ip_info.gw);
        esp_netif_str_to_ip4("255.255.255.0", &ip_info.netmask);
        esp_netif_dhcps_stop(wifi_ap_netif);
        esp_netif_set_ip_info(wifi_ap_netif, &ip_info);
        esp_netif_dhcps_start(wifi_ap_netif);

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ESP_ERROR_CHECK(esp_wifi_init(&cfg));
        netif_inited = true;
    }
}

static void wifi_start(void)
{
    if (wifi_started) return;

    wifi_init_netif();

    wifi_config_t wifi_config = {
        .ap = {
            .channel = WIFI_CHANNEL,
            .authmode = WIFI_AUTH_OPEN,
            .max_connection = MAX_CONNECTIONS,
        },
    };
    strncpy((char *)wifi_config.ap.ssid, device_name, sizeof(wifi_config.ap.ssid));
    wifi_config.ap.ssid_len = strlen(device_name);

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

    wifi_started = true;
    ESP_LOGI(TAG, "WiFi AP started: SSID=%s, http://192.168.9.1", device_name);
}

/* Load device name from NVS. Returns true if found. */
static bool load_device_name(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READONLY, &h) != ESP_OK) return false;
    size_t len = sizeof(device_name);
    esp_err_t err = nvs_get_str(h, "name", device_name, &len);
    nvs_close(h);
    if (err == ESP_OK && device_name[0]) {
        ESP_LOGI(TAG, "Loaded device name from NVS: %s", device_name);
        return true;
    }
    return false;
}

/* Save device name to NVS */
static void save_device_name(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_str(h, "name", device_name);
    nvs_commit(h);
    nvs_close(h);
    ESP_LOGI(TAG, "Saved device name to NVS: %s", device_name);
}

/* Load WiFi duty cycle setting from NVS */
static void load_duty_cycle(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READONLY, &h) != ESP_OK) return;
    uint8_t val = 0;
    if (nvs_get_u8(h, "duty", &val) == ESP_OK) {
        wifi_duty_cycle = (val != 0);
        ESP_LOGI(TAG, "Loaded duty cycle from NVS: %s", wifi_duty_cycle ? "ON" : "OFF");
    }
    nvs_close(h);
}

/* Save WiFi duty cycle setting to NVS */
void save_duty_cycle(void)
{
    nvs_handle_t h;
    if (nvs_open("bridge", NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_u8(h, "duty", wifi_duty_cycle ? 1 : 0);
    nvs_commit(h);
    nvs_close(h);
    ESP_LOGI(TAG, "Saved duty cycle to NVS: %s", wifi_duty_cycle ? "ON" : "OFF");
}

/* Update WiFi SSID and BLE name to match station ID */
static void update_device_name(const char *name)
{
    if (strcmp(device_name, name) == 0) return;  /* no change */

    strncpy(device_name, name, sizeof(device_name) - 1);
    device_name[sizeof(device_name) - 1] = '\0';

    /* Persist to NVS so next boot uses this name immediately */
    save_device_name();

    /* Update BLE advertising name */
    ble_beacon_set_name(device_name);

    /* Restart WiFi AP with new SSID */
    if (wifi_started) {
        wifi_config_t wifi_config = {
            .ap = {
                .channel = WIFI_CHANNEL,
                .authmode = WIFI_AUTH_OPEN,
                .max_connection = MAX_CONNECTIONS,
            },
        };
        strncpy((char *)wifi_config.ap.ssid, device_name, sizeof(wifi_config.ap.ssid));
        wifi_config.ap.ssid_len = strlen(device_name);
        esp_wifi_set_config(WIFI_IF_AP, &wifi_config);
        ESP_LOGI(TAG, "WiFi SSID updated: %s", device_name);
    }
}

