chriskinal/QuailTracker/esp32_bridge/src/main.c
        /* Update BLE advertising data periodically */
        ble_beacon_update_data(last_battery_mv, last_recording, last_pwr_state);
    }
}

/* ── BLE Callbacks ─────────────────────────────────────────────── */

static void on_ble_connect(void)
{
    ESP_LOGI(TAG, "BLE client connected — transitioning to NORMAL_POWER");
    bridge_state = BRIDGE_NORMAL_POWER;
    disconnect_tick = 0;

    /* Wake STM32 if it's sleeping */
    if (stm32_sleeping) {
        stm32_wake();
    }
}

static void on_ble_disconnect(void)
{
    ESP_LOGI(TAG, "BLE client disconnected — starting 30s timeout");
    disconnect_tick = xTaskGetTickCount();
}

/* ── Power Management Task ─────────────────────────────────────── */

/* ── Captive Portal DNS Server ──────────────────────────────────── */

/* Minimal DNS server: responds to ALL queries with 192.168.9.1.
 * This makes the phone think it needs to "log in", triggering the
 * captive portal popup which loads our web UI automatically. */
static void dns_task(void *arg)
{
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "DNS: socket failed");
        vTaskDelete(NULL);
        return;
    }

    struct sockaddr_in saddr = {
        .sin_family = AF_INET,
        .sin_port = htons(53),
        .sin_addr.s_addr = htonl(INADDR_ANY),
    };
    if (bind(sock, (struct sockaddr *)&saddr, sizeof(saddr)) < 0) {
        ESP_LOGE(TAG, "DNS: bind failed");
        close(sock);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "DNS captive portal started on port 53");

    uint8_t buf[512];
    while (1) {
        struct sockaddr_in client;
        socklen_t clen = sizeof(client);
        int len = recvfrom(sock, buf, sizeof(buf), 0, (struct sockaddr *)&client, &clen);
        if (len < 12) continue;  /* too short for DNS header */

        /* Build response: copy query, set response flags, append answer */
        uint8_t resp[512];
        memcpy(resp, buf, len);

        /* Set QR=1 (response), AA=1 (authoritative), RA=1 */
        resp[2] = 0x84;  /* QR=1, Opcode=0, AA=1, TC=0, RD=0 */
        resp[3] = 0x00;  /* RA=0, Z=0, RCODE=0 (no error) */

        /* Answer count = 1 */
        resp[6] = 0x00;
        resp[7] = 0x01;

        /* Append answer: pointer to name in query + type A + class IN + TTL + IP */
        int pos = len;
        resp[pos++] = 0xC0;  /* pointer to name at offset 12 */
        resp[pos++] = 0x0C;
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* type A */
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* class IN */
        resp[pos++] = 0x00; resp[pos++] = 0x00;
        resp[pos++] = 0x00; resp[pos++] = 0x0A;  /* TTL = 10s */
        resp[pos++] = 0x00; resp[pos++] = 0x04;  /* data length = 4 */
        resp[pos++] = 192;                        /* 192.168.9.1 */
        resp[pos++] = 168;
        resp[pos++] = 9;
        resp[pos++] = 1;

        sendto(sock, resp, pos, 0, (struct sockaddr *)&client, clen);
    }
}

/* ── Power Management Task ─────────────────────────────────────── */

static void power_mgmt_task(void *arg)
{
    uint32_t duty_cycle_tick = xTaskGetTickCount();

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        /* Check if any WiFi clients are connected */
        wifi_sta_list_t sta_list;
        int wifi_clients = 0;
        if (wifi_started && esp_wifi_ap_get_sta_list(&sta_list) == ESP_OK) {
            wifi_clients = sta_list.num;
        }

        /* Reset duty cycle timer while client is connected */
        if (wifi_clients > 0) {
            duty_cycle_tick = xTaskGetTickCount();
        }

        /* WiFi duty cycle: on 20s, then deep sleep 40s.
         * Deep sleep draws ~5µA vs 44mA with WiFi off + CPU idle.
         * On wake, ESP32 reboots — WiFi/NVS/BLE all reinitialize. */
        if (wifi_duty_cycle && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - duty_cycle_tick) * portTICK_PERIOD_MS;
            if (elapsed >= WIFI_DUTY_ON_MS) {
                ESP_LOGI(TAG, "Duty cycle: entering deep sleep for %ds", WIFI_DUTY_SLEEP_S);
                esp_deep_sleep(WIFI_DUTY_SLEEP_S * 1000000ULL);
                /* Does not return — ESP32 reboots on wake */
            }
        }
    }
}

/* ── Main ──────────────────────────────────────────────────────── */

void app_main(void)
{
    printf("\n=== ESP32-C3 QuailTracker Bridge v2 ===\n\n");

    /* FIRST: release STM32 BOOT0/NRST pins to high-Z */
    stm32_pins_init();

    /* Initialize NVS (required for WiFi + BLE) */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    /* Load device name: NVS first, then fall back to MAC-based default */
    if (!load_device_name()) {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        snprintf(device_name, sizeof(device_name), "QT_%02X%02X", mac[4], mac[5]);
        ESP_LOGI(TAG, "No saved name, using default: %s", device_name);
    }

    load_duty_cycle();

    /* Initialize network interface (needed before WiFi or BLE) */
    wifi_init_netif();

    /* Start BLE beacon (always active for device discovery) */
    ble_beacon_init(device_name, on_ble_connect, on_ble_disconnect);

    /* Start in NORMAL_POWER on boot so WiFi AP is available for setup.
     * Will transition to LOW_POWER after BLE disconnect timeout if no
     * user is connected, or when STM32 sends sleep command. */
    bridge_state = BRIDGE_NORMAL_POWER;
    wifi_start();
    start_webserver();
    spi_slave_init();

    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);
    xTaskCreate(ws_push_task, "ws_push", 4096, NULL, 4, NULL);
    xTaskCreate(power_mgmt_task, "pwr_mgmt", 4096, NULL, 2, NULL);
    xTaskCreate(dns_task, "dns", 4096, NULL, 2, NULL);

    ESP_LOGI(TAG, "Bridge ready — BLE Beacon + WiFi AP + SPI + WebSocket");
}
